app/views/tracks/edit.html.erb

SELECT  "albums".* FROM "albums" WHERE (id = 76) LIMIT 1
---
<h3>Edit "<%= Album.find_by("id = #{params[:id]}").title %>" Tracks</h3>

SELECT  "tracks".* FROM "tracks" WHERE (id = params[:id]) LIMIT 1
---
<ol>
<% tracks = Track.where("album_id = #{params[:id]}") %>