app/views/descriptions/new.html.erb

SELECT  "albums".* FROM "albums" WHERE (id = 76) LIMIT 1
---
<h3>Add a tag to "<%= Album.find_by("id = #{params[:album_id]}").title %>"</h3>