app/views/albums/edit.html.erb

SELECT  "artists".* FROM "artists" WHERE (id = 230) LIMIT 1
---
    <label for="artist">Artist:</label>
    <input name="artist" id="artist" value="<%= Artist.find_by("id = #{@album.artist_id}").name %>">