app/views/albums/index.html.erb


<p><%= @albums.count %> Albums.</p>
---
SELECT "albums".* FROM "albums" WHERE (title LIKE '%19%')  ORDER BY title asc
SELECT COUNT(*) FROM "albums" WHERE (title LIKE '%bruce%' OR

      <td><%= link_to album.title, album_url(album.id) %></td>
      <td><%= (Artist.find_by("id = #{album.artist_id}")).name %></td>
---
SELECT  "artists".* FROM "artists" WHERE (id = 71) LIMIT 1