app/views/albums/show.html.erb

SELECT  "collections".* FROM "collections" WHERE (user_id = 31) AND (album_id = 76) LIMIT 1
---
  <p>
  <% if Collection.where("user_id = #{session["user_id"]}").find_by("album_id = #{@album.id}") == nil %>

SELECT "tracks".* FROM "tracks" WHERE (album_id = 73)
---
<% end %>
<% tracks = Track.where("album_id = #{@album.id}") %>

SELECT "descriptions".* FROM "descriptions" WHERE (album_id = 73)  ORDER BY tag_score desc
---
<table>
<% tags = Description.where("album_id = #{@album.id}").order("tag_score desc") %>

SELECT  "tags".* FROM "tags" WHERE (id = 408) LIMIT 1
---
  <a href="/descriptions/increase/<%= tag.id %>">&#9651</a><br>
  <span><%= tag.tag_score %> <%= (Tag.find_by("id = #{tag.tag_id}")).name %></span><br>

SELECT  "users".* FROM "users" WHERE (id = 4) LIMIT 1
---
	end %>
	<%= (User.find_by("id = #{review.user_id}")).username %> <br>