app/controllers/albums_controller.rb

  def find_album
    @album = Album.find_by(id: params["id"])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 77]]

  def index
  	if params["keyword"].present?
  		@albums = Album.where("title LIKE '%#{params["keyword"]}%'")
    else
      @albums = Album.all.page(params[:page])
---
SELECT "albums".* FROM "albums" WHERE (title LIKE '%19%')  ORDER BY title asc
SELECT  "albums".* FROM "albums"  ORDER BY title asc LIMIT 100 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "albums" LIMIT 100 OFFSET 0) subquery_for_count

  def show
  	@reviews = Review.where("album_id = #{params["id"]}").order("score desc")
---
SELECT "reviews".* FROM "reviews" WHERE (album_id = 55)  ORDER BY score desc

  def create
    if Artist.find_by("name = '#{params["artist"]}'") == nil
      a = Artist.new
      a.name = params[:artist]
      a.save
    end
    artist = Artist.find_by("name = '#{params["artist"]}'")
  	album = Album.new
  	album.title = params[:title]
  	album.artist_id = artist.id
  	album.year = params[:year]
  	album.album_cover_url = params[:album_cover_url]
  	album.save
---
SELECT  "artists".* FROM "artists" WHERE (name = 'Bruce Springsteen') LIMIT 1
INSERT INTO "artists" ("name") VALUES (?)  [["name", "Michael Jackson"]]
INSERT INTO "albums" ("title", "artist_id", "year", "rating") VALUES (?, ?, ?, ?)  [["title", "Born In The U.S.A."], ["artist_id", 71], ["year", 1984], ["rating", 5]]

  def update
    if Artist.find_by("name = '#{params["artist"]}'") == nil
      a = Artist.new
      a.name = params[:artist]
      a.save
    end
    artist = Artist.find_by("name = '#{params["artist"]}'")
    @album.title = params[:title]
    @album.artist_id = artist.id
    @album.year = params[:year]
    @album.album_cover_url = params[:album_cover_url]
    if @album.save
---
SELECT  "artists".* FROM "artists" WHERE (name = 'MIchael Jackson') LIMIT 1
INSERT INTO "artists" ("name") VALUES (?)  [["name", "MIchael Jackson"]]
UPDATE "albums" SET "artist_id" = ? WHERE "albums"."id" = ?  [["artist_id", 234], ["id", 76]]