app/controllers/albums_controller.rb

	def show
		@reviews = Review.where("album_id = #{params["id"]}").order("id desc")
---
SELECT "reviews".* FROM "reviews" WHERE (album_id = 140)  ORDER BY rank desc

	def new
		@artists = Artist.order('name')
---
SELECT "artists".* FROM "artists"  ORDER BY name