app/controllers/collections_controller.rb

INSERT INTO "collections" ("user_id", "album_id") VALUES (?, ?)  [["user_id", 31], ["album_id", 77]]
---
  def new
    c = Collection.new
    c.user_id = session[:user_id]
    c.album_id = params[:album_id]
    c.save

SELECT  "albums".* FROM "albums" WHERE (id = 71) LIMIT 1
DELETE FROM "collections" WHERE "collections"."id" = ?  [["id", 56]]
SELECT  "collections".* FROM "collections" WHERE (user_id = 31 AND album_id = 71) LIMIT 1
---
  def destroy
  	a = Album.find_by("id = #{params[:album_id]}")
  	Collection.find_by("user_id = #{session[:user_id]} AND album_id = #{params[:album_id]}").destroy