app/controllers/descriptions_controller.rb

  def create
    if Tag.find_by("name = '#{params["tag"]}'") == nil
      t = Tag.new
      t.name = params[:tag]
      t.save
    end
    t = Tag.find_by("name = '#{params["tag"]}'")
    if Description.find_by("album_id = #{params[:album_id]} AND tag_id = #{t.id}") != nil
      redirect_to "/albums/#{params[:album_id]}", notice: "This album already has that tag"
    else
      desc = Description.new
      desc.album_id = params[:album_id]
      desc.tag_id = t.id
      desc.save
---
SELECT  "tags".* FROM "tags" WHERE (name = 'Hot') LIMIT 1
INSERT INTO "tags" ("name") VALUES (?)  [["name", "Hot"]]
SELECT  "descriptions".* FROM "descriptions" WHERE (album_id = 76 AND tag_id = 416) LIMIT 1
INSERT INTO "descriptions" ("album_id", "tag_id") VALUES (?, ?)  [["album_id", 76], ["tag_id", 431]]

  def increase
    if session[:user_id].present?
      d = Description.find_by("id = #{params["id"]}")
      d.tag_score += 1
      d.save
---
SELECT  "descriptions".* FROM "descriptions" WHERE (id = 343) LIMIT 1
UPDATE "descriptions" SET "tag_score" = ? WHERE "descriptions"."id" = ?  [["tag_score", 12], ["id", 343]]

  def decrease
    if session[:user_id].present?
      d = Description.find_by("id = #{params["id"]}")
      d.tag_score -= 1
      d.save
---
SELECT  "descriptions".* FROM "descriptions" WHERE (id = 342) LIMIT 1
UPDATE "descriptions" SET "tag_score" = ? WHERE "descriptions"."id" = ?  [["tag_score", 8], ["id", 342]]