app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE (id = 66) LIMIT 1
UPDATE "reviews" SET "score" = ? WHERE "reviews"."id" = ?  [["score", 2], ["id", 66]]
---
	def increase
    if session[:user_id].present?
      r = Review.find_by("id = #{params["id"]}")
      r.score += 1
      r.save

SELECT  "reviews".* FROM "reviews" WHERE (id = 84) LIMIT 1
UPDATE "reviews" SET "score" = ? WHERE "reviews"."id" = ?  [["score", -1], ["id", 84]]
---
  def decrease
    if session[:user_id].present?
      r = Review.find_by("id = #{params["id"]}")
      r.score -= 1
      r.save

INSERT INTO "reviews" ("album_id", "rating", "desc", "user_id") VALUES (?, ?, ?, ?)  [["album_id", 140], ["rating", 5], ["desc", "Great!"], ["user_id", 36]]
SELECT  "albums".* FROM "albums" WHERE (id = 76) LIMIT 1
SELECT "reviews".* FROM "reviews" WHERE (album_id = 76)
UPDATE "albums" SET "rating" = ?, "rating_count" = ? WHERE "albums"."id" = ?  [["rating", 3], ["rating_count", 5], ["id", 76]]
---
	def create
	    r = Review.new
	    r.album_id = params[:album_id]
	    r.rating = params[:rating]
	    r.desc = params[:desc]
	    r.user_id = session["user_id"]
	    r.save
	    a = Album.find_by("id = #{r.album_id}")
	    reviews = Review.where("album_id = #{r.album_id}")
	    total_stars = 0
	    review_count = 0
	    reviews.each do |review|
	    	total_stars += review.rating
	    	review_count += 1
	    end
	    a.rating = total_stars / review_count
	    a.rating_count = review_count
	    a.save