app/controllers/tracks_controller.rb

  def create
    track = Track.new
    track.album_id = params[:album_id]
    track.name = params[:name]
    track.save
---
INSERT INTO "tracks" ("album_id", "name") VALUES (?, ?)  [["album_id", 76], ["name", "DovescRy"]]

  def update
    track = Track.find_by("id = #{params[:id]}")
    track.name = params[:name]
    track.save
---
SELECT  "tracks".* FROM "tracks" WHERE (id = 76) LIMIT 1
UPDATE "tracks" SET "name" = ? WHERE "tracks"."id" = ?  [["name", "2000"], ["id", 2026]]

  def destroy
  	track = Track.find_by("id = #{params[:id]}")
  	album_id = track.album_id
  	track.delete
---
SELECT  "tracks".* FROM "tracks" WHERE (id = 2036) LIMIT 1
DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 2036]]