app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE (id = session[:user_id]) LIMIT 1
SELECT "collections".* FROM "collections" WHERE (user_id = user.id)
SELECT "albums".* FROM "albums" WHERE (id = c.album_id)
---
  def show
    user = User.find_by("id = #{session[:user_id]}")
    coll = Collection.where("user_id = #{user.id}")
    @albums = []
    coll.each do |c|
      @albums += Album.where("id = #{c.album_id}")

INSERT INTO "users" ("email", "password_digest") VALUES (?, ?)  [["email", "scout@example.com"], ["password_digest", "$2a$10$ZMIXn7D8vY9j3RKjaOOl9e4UbBn0NRFeJCBNY3UR19iGafo54XZuW"]]
---
  def create
    @user = User.new(username: params[:username], password: params[:password])
    if @user.save